app/controllers/newsletter_sign_ups_controller.rb

INSERT INTO "newsletter_sign_ups" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Debbie"], ["email", "despino13@yahoo.com"], ["created_at", "2016-06-22 23:14:32.578724"], ["updated_at", "2016-06-22 23:14:32.578724"]]
---
  def create
    @newsletter_sign_up = NewsletterSignUp.new newsletter_sign_up_params
    if @newsletter_sign_up.save